## Plan Result (prod-enterprise)




<pre><code>Plan: 88 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform System Integration Testing&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Security&#34;]
* Update
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azuread_service_principal.sp




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6b2c4a37-044e-4f83-9bd6-c8181f81f4dd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff5ea8a7-a509-4f4a-ad85-9e27d5aa81e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "28bc2a45-9313-445b-a09c-2a6f31132d14"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2e6ff9f6-d09c-4033-b374-24c04660487e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c12b0ed-9996-47f3-8902-0c9046fac4b4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e0c910b7-cab0-4066-8299-0754a3ca6a17"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d5e3ba53-7eef-495b-8e95-abce4056f40a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ac2dc06b-61e8-4ebe-ac14-c680724944f3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "44c2562a-c42f-44ad-baed-6d756e552421"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13b7591b-6a22-41f7-aeb4-89926785c0ce"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "890ccf59-f9e5-4758-a392-2c03e4fdaeb5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02ea7c69-56e5-4e48-83eb-5cc721dfb432"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6cdfafb8-0cc7-4f85-8758-c055da3ae2ec"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "847b4c4a-6bdf-4e35-b8f3-dc6a81b89d57"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cfd53954-7782-4aae-b100-8108eb8f6094"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-QA"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "279ff279-b495-48da-ad6d-e43d9ba38191"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e128cf2-6ab5-488b-8128-634ed5ac4c18"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-RDO-Development"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "29624f48-a0ac-42cc-b7d4-3551d987adb9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-RDO-Production"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8417a04-42fb-4019-8976-094376df09f4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/00b9a00a-20eb-4173-b7b6-468e00836a33"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-ROBOTICS-DEV"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "486a3048-3e66-4b76-8371-b7d0d2b3f1ab"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/6fe2c66c-ef6f-4064-9ced-95ac3fb8966f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-ROBOTICS-SBOX"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e36533dc-2be3-420a-9a5f-882560063019"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ARCHIVING-PROD"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3d15a4dc-9f5b-45f5-ac72-ad9d391d5bda"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b40cd6f9-4d97-4b07-a6d7-fab86c92c0d4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/cad00ede-36df-4e04-ad0b-d34a1e94ef76"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTPTL-INTSVC"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e758ec9b-b7e9-46c1-98e1-f552405a2802"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-CFTSBOX-INTSVC"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "62b7e5c7-08ed-45bd-b0c8-66477ad66101"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope           

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

erations"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f8a755d9-1632-4e7e-8914-b4ee6dd72425"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Common Platform System Integration Testing"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fae90739-d1ff-44f4-bb2c-05cb5799e621"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e76fe869-ce2f-46db-bd9d-f79bce5b7673"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5cfbc1e7-241a-4729-9b16-089360ab3f54"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a3a9204-8f79-403f-9917-5a19bc3ea045"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "94d21afe-5d3d-41a9-8262-067241c81d9d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e14935a4-5052-4110-8318-ef8363e2a494"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c7262233-ac8d-4650-a88d-c31f5b549c7b"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db241a13-e1af-449e-a057-3322d10680bd"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5c4c69e9-4b92-467b-bb44-764dad94494e"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Crime"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "457d17d7-4722-47c9-acd0-aabd54335a50"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["HMCTS"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9af4d172-3664-49ea-902e-9e1039574590"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5788d6d6-5165-4750-90bd-44e944f4238d"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c588d2f4-73d1-44db-9cce-1ad7920b1883"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be919cb4-3946-4ce0-8577-e3570ced23d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "97daa318-c07d-4f86-8ce1-96d5e40d22cb"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "762f9e7d-0420-4126-8d9f-d024e52fbf69"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3f403c82-6297-40ba-9032-b8f6e1183bc7"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0166318b-2481-4cd3-b38e-81db220d3cd6"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cd92217a-4300-4f77-b572-d24611b6fbb9"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "61c41229-d483-4019-87d9-77679eb59a6b"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1d864ce4-9b54-4bb3-bf08-3bbb066b530d"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4934bc90-b58f-40ef-aaa2-1ea7e3395191"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5c81c442-b9b3-45ec-ad70-c679de32432b"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Security"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b7b6ec13-2839-417e-a307-e723d29b90b8"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 88 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->